# 구매한 물건가격 : 47200
# 낸 돈 : 50000
# --------------
# 거스름돈 : 2800
# 5만원 : 0
# 1만원 : 0
# 5천원 : 0
# 1천원 : 2
# 5백원 : 1
# 1백원 : 3
# 5십원 : 0
# 1십원 : 0


낸돈 = int(input("낸 돈 : "))
구매한물건가격 = int(input("구매한 물건가격 : "))
print("-----------")
거스름돈 = 낸돈 - 구매한물건가격
print("거스름돈 : %d" % 거스름돈)

a = 거스름돈 / 50000
print("5만원 : %d " % a)
거스름돈 %= 50000

a = 거스름돈 / 10000
print("1만원 : %d " % a)
거스름돈 %= 10000

a = 거스름돈 / 5000
print("5천원 : %d " % a)
거스름돈 %= 5000

a = 거스름돈 / 1000
print("1천원 : %d " % a)
거스름돈 %= 1000

a = 거스름돈 / 500
print("5백원 : %d " % a)
거스름돈 %= 500

a = 거스름돈 / 100
print("1백원 : %d" % a)
거스름돈 %= 100

a = 거스름돈 / 50
print("1백원 : %d" % a)
거스름돈 %= 50

a = 거스름돈 / 10
print("1백원 : %d" % a)
거스름돈 %= 10
