# 개발자 : 프로그래머, 코더

# 한국어로 설계 -번역-> .java
# .java -번역(compile)-> .class
# .class -실행->

# 한국어로 설계 -번역-> .py
# .py =실행->

# 한국어로 설계 - 번역(coding)-> Python
# Python -번역-> 기계어
# 기계어 -실행->

# 컴파일러 방식 vs 인터프리터 방식
#   컴파일러 : 소스 전체를 한번에 기계어로 바꿈
#               에러있으면 아예 실행불가
#   인터프리터 : 일단 실행 -> 한줄씩 기계어로 바꾸면서 실행
#               에러있어도 돌고 결과는...
#               에러잡기가 힘들다.

# 일반적인 프로그래밍 언어
#   엔터치는거 의미없음 -> ;를 써서 문장 끝났음을 알림
#   띄어쓰기 의미없음 -> 가독성의 영역

# Python : 프로그래밍 언어
#   비교적 신제품
#   인터프리터 언어
#   엔터치기 or ; 문장 끝났다고 인식
#   띄어쓰기가 문법적으로 의미가 있음
print("ㅎㅎ"); print("ㅋㅋ")